namespace Src.Common;

// ============================================================================
// 列挙値定義
// ============================================================================

public enum 調査状況Enum : short
{
    ルート作成中 = 0,
    調査依頼中 = 10,
    調査済 = 80
}


public enum 調査ステータスEnum : short
{
    一時保存 = 0,
    依頼中 = 10,
    調査予定 = 20,
    調査済 = 80
}

public enum 調査優先度Enum : short
{
    低 = 10,
    中 = 20,
    高 = 30,
}

public enum 調査手法Enum : short
{
    通過 = 0,
    周回 = 1,
}

public enum 調査箇所登録方法Enum : short
{
    点 = 0,
    線 = 16,
    河川KP = 17,
    道路KP = 18,
}
